app/Http/Controllers/HomeController.php

select count(*) as aggregate from `enregs` where `statut` = 'N'
select count(*) as aggregate from `enregs` where `statut` = 'V'
select count(*) as aggregate from `enregs` where `statut` = 'A'
---
    public function index()
    {
        if (Auth::user()->roles()->first()->name != 'Client') {

        $news = Enreg::where('statut', 'N')->count();
        $valides = Enreg::where('statut', 'V')->count();
        $archives = Enreg::where('statut', 'A')->count();