app/Http/Controllers/OfflineSyncController.php

    public function postData()
    {

        $users =  DB::table('users')
                    ->select('users.*','roles.name As role')
                    ->join('model_has_roles','model_has_roles.model_id','=','users.id')
                    ->join('roles','model_has_roles.role_id','=','roles.id')
                    ->where('online',0)
                    ->where('offline',1)
                    ->get();

        $enregs = DB::table('enregs')->where('online',0)
                    ->where('offline',1)
                    ->get();
---
select `users`.*, `roles`.`name` as `role` from `users` inner join `model_has_roles` on `model_has_roles`.`model_id` = `users`.`id` inner join `roles` on `model_has_roles`.`role_id` = `roles`.`id` where `online` = 0 and `offline` = 1
select * from `enregs` where `online` = 0 and `offline` = 1

    public function getData()
    {
        $response = Http::get('https://e-macaroni.com/public/online_sync/getData');
                            // ->get('http://localhost:8001/online_sync/getData');https://jsonplaceholder.typicode.com/posts
                            //https://e-macaroni.com/public/online_sync/getData

        $jsonData = $response->json();

        // dd($jsonData);

        if ($jsonData && $jsonData['status'] === 'success') {
            $users = $jsonData['data']['users'];
            $enregs = $jsonData['data']['enregs'];

            $usersTemp = $jsonData['data']['users'];
            $enregsTemp = $jsonData['data']['enregs'];


            if (count($users) > 0) {
                foreach ($users as $user) {
                    //dd($user['id']);
                    $id = $user['id'];
                    $role = $user['role'];
                    unset($user['id']);
                    unset($user['role']);
                    $user['online'] = 1;
                    $user['offline'] = 1;
                    DB::table('users')->updateOrInsert(['id' => $id], $user);
                    $user = User::where('email', $user['email'])->where('name', $user['name'])->first();
---
update `users` set `name` = 'superAdmin', `email` = 'suadmin@example.bf', `contact` = '75509104', `statut` = 1, `email_verified_at` = '', `password` = '$2y$12$r26CPv.UvrPAa89utveULu/pdblbdYE.Pfb24x1cH99ZSxhVx5x1C', `remember_token` = '', `online` = 1, `offline` = 1, `created_at` = '2024-04-03 15:40:25', `updated_at` = '2024-04-03 15:40:25' where (`id` = 1) limit 1
select * from `users` where `email` = 'suadmin@example.bf' and `name` = 'superAdmin' limit 1